/*
 * Account_UI.c
 *
 *  Created on: 2015年5月8日
 *      Author: Administrator
 */

#include "Account_UI.h"

#include "../Common/List.h"
#include "../Service/Account.h"
#include "../Service/EntityKey.h"
#include "Account_UI.h"
/* #include<conio.h> 
#include<windows.h> */
#include <stdio.h>
#include<assert.h>
#include<string.h>
#include <unistd.h>
#include <sys/time.h>
void Account_UI_MgtEntry()
int SysLogin(); 
{
	int  id,chioce;
	char password[30],username[30];
	printf("\n=========================================================\n");
	printf("\n*********************用 户 登 录*************************\n");
	printf("请选择您的登录方式，按0退出。\n");
	printf("---------------1、游客登录---------------\n");
	printf("---------------2、员工登录---------------\n");
	printf("---------------0、退出-------------------\n");
	printf("\n*********************************************************\n");
	printf("\n=========================================================\n");
	scanf("%d",&chioce);
	switch(chioce)
	{
	    case 1:
	    	break;
	    case 2:
	    	{
	    	 printf("\n=======================================================\n");
			 printf("\n*********************信 息 填 写***********************\n"); 
			 printf("请输入您的信息：\n");
			 printf("请输入您的ID:");
			 scanf("%d",&id);
			 printf("请输入您的用户名：\n");
			 scanf("%s",username);
			 printf("请输入密码：\n");
			 scanf("%s",password);
			 printf("\n*******************************************************\n");
			 printf("\n=======================================================\n");
			}
		case 0:return;
	}
	printf("\n"); 
}

//管理系统用户功能入口函数，显示用户账号管理菜单

void Account_UI_add(account_list_t list ) 
 {
	int choice,id;
	char password[30],username[30];
	printf("\n=========================================================\n");
	printf("\n*******************添 加 账 户 信 息*********************\n");
	printf("\n请您选择，退出请按0：\n");
	printf("------------------------1、信息添加------------------------\n");
	printf("------------------------0、退出----------------------------\n");
	printf("\n*********************************************************\n");
	printf("\n=========================================================\n");
	scanf("%d",choice);
	switch(choice)
	{
		case 1:
			{
				printf("\n=======================================================\n");
			    printf("\n*******************添 加 账 户 信 息*******************\n");
			    printf("请输入新添加的信息：\n");
			    printf("请输入您的ID:\n");
			    scanf("%d",&id);
			    printf("请输入新添加的用户名：\n");
			    scanf("%s",username);
			    printf("请输入密码：\n");
			    scanf("%s",password);
			    printf("\n*******************************************************\n") 
			    printf("\n=======================================================\n");
			}
		case 0:return;
	}
	printf("\n");
 }


//添加一个用户账号信息
int Account_UI_Modify(account_list_t list ) 
{
	int choice,id;
	char password[30],username[30],newpassword[30];
	printf("\n=========================================================\n");
	printf("\n*******************修 改 账 户 密 码*********************\n");
	printf("\n请您选择，退出请按0：\n");
	printf("------------------------1、密码修改------------------------\n");
	printf("------------------------0、退出----------------------------\n");
	printf("\n*********************************************************\n");
	printf("\n=========================================================\n");
    scanf("%d",choice);
	switch(choice)
	{
		case 1:
			{
				printf("\n=========================================================\n");
            	printf("\n*******************修 改 账 户 密 码*********************\n");
			    printf("请输入您的信息：\n");
			    printf("请输入您的ID:");
			    scanf("%d",&id);
			    printf("请输入您的用户名：\n");
			    scanf("%s",username);
			    printf("请输入旧密码：\n");
			    scanf("%s",password);
			    printf("请输入新密码：\n");
			    scanf("%s",newpassword);
			    printf("\n*******************************************************\n");
			    printf("\n=======================================================\n");
			}
		case 0:return;	
	}
	printf("\n");
}

//根据用户账号名修改用户账号密码，不存在这个用户账号名，提示出错信息
int Account_UI_Delete(account_list_t list ,char usrName[])
 {
       int choice,id;
	printf("\n=========================================================\n");
	printf("\n*********************账 户 删 除*************************\n");
	printf("\n请您选择，退出请按0：\n");
	printf("------------------------1、账户删除------------------------\n");
	printf("------------------------0、退出----------------------------\n");
	printf("\n*********************************************************\n");
	printf("\n=========================================================\n");
    scanf("%d",&choice);
	switch(choice)
	{
		case 1:
			{
				printf("\n=========================================================\n");
            	printf("\n**********************账 户 删 除************************\n");
			    printf("请输入您的信息：\n");
			    printf("请输入您的ID:");
			    scanf("%d",&id);
			    { 
			       if(组长我觉得这里要调用一些我不知道的东西，所以你自己来) 
			           printf("账户信息错误！！")；
				   else
				   printf("删除成功"); 
			    }
				printf("\n*******************************************************\n");
			    printf("\n=======================================================\n");
			}
		case 0:return;	
	}
	printf("\n");
}
     //根据用户账号名删除一个已经存在的用户账号信息，如果不存在这个用户账号名，提示出错信息
int Account_UI_Query(account_list_t list ,char usrName[])
 {
int choice;
	char username[30];
	printf("\n=========================================================\n");
	printf("\n*********************账 户 查 找*************************\n");
	printf("\n请您选择，退出请按0：\n");
	printf("\n----------------------1、账户查找------------------------\n");
	printf("\n----------------------0、退出----------------------------\n");
	printf("\n*********************************************************\n");
	printf("\n=========================================================\n");
    scanf("%d",choice);
	switch(choice)
	{
		case 1:
			{
				printf("\n=========================================================\n");
            	printf("\n*********************账 户 查 找*************************\n"); 
			    printf("请输入您的用户名：\n");
			    scanf("%s",username);
			    printf("组长这里貌似也是调用、、、、、")
			    printf("\n*********************************************************\n");
			    printf("\n=========================================================\n");
			}
		case 0:return;	
	}
	printf("\n");
}

//根据用户账号名查找该用户账号是否存在，存在返回1，否则返回0，并提示错误信息



